#จำนวนเงิน ??? บาท จำนวนคน ?? คน หารกี่คน
money = float(input("ราคาทั้งหมด : "))
money0 = f"{money:.2f}"
kon = int(input("จำนวนคน : "))
compile = money / kon
compile0 = f"{int(compile):.2f}"
print ("-------------------------------------------")
print (f"ราคาที่ต้องจ่าย : {money0} บาท จำนวนคนทั้งหมด : {kon} คน หารตกคนละ : {compile0} บาท")
print ("-------------------------------------------")
print ("ราคาที่ต้องจ่าย :",money0,"บาท" ,"จำนวนคนทั้งหมด :" ,kon, "คน หารตกคนละ :" ,compile0, "บาท")
print ("-------------------------------------------")
print ("ราคาที่ต้องจ่าย : "+str(money0)+" บาท จำนวนคนทั้งหมด : "+str(kon)+" คน หารตกคนละ : "+str(compile0)+" บาท")
print ("-------------------------------------------")
print ("ราคาที่ต้องจ่าย : {} บาท จำนวนคนทั้งหมด : {} คน หารตกคนละ : {} บาท".format(money0,kon,compile0))
print ("-------------------------------------------")
print ("ราคาที่ต้องจ่าย : %.2f บาท จำนวนคนทั้งหมด : %s คน หารตกคนละ : %.2f บาท"%(money,kon,compile))
print ("-------------------------------------------")